{
  "document_title": "Capture the exact title of the DDP document as provided by the user. Ask for it if missing.",
  "product_name": "Use the product or system name described in the plan. If multiple appear, confirm the primary one.",
  "version": "Record the version or revision identifier (e.g., v1.2, Rev B). If absent, ask the user to supply it.",
  "revision_date": "Parse the most recent revision or approval date in ISO format (YYYY-MM-DD).",
  "prepared_by": "List each contributor with name, role, and organization if stated. Preserve the provided ordering.",
  "purpose": "Summarize why the DDP exists and the objectives it supports.",
  "background": "Provide concise context, history, or references that led to the current plan.",
  "design_inputs": "Create one entry per requirement. Map source citations (e.g., standards, user need IDs) to `source` and the corresponding statement to `requirement`. Include acceptance criteria when defined.",
  "design_constraints": "List explicit constraints (regulatory, technical, environmental). Each bullet becomes an item.",
  "intended_use": "Describe how the product is meant to be used, including patient/population and environment if available.",
  "user_needs": "Capture each user need or requirement as a separate array item using concise phrasing.",
  "design_outputs": "List resulting deliverables or specifications that satisfy inputs. Link to an input identifier when provided.",
  "risks": "For each hazard analysis row, populate hazard, harm, and mitigation. Map severity/probability words to the allowed enumerations.",
  "verification_plan": "For each verification activity, record the item under test, method, acceptance criteria, status, and due date if stated.",
  "validation_plan": "Capture each validation study or activity with its method, acceptance criteria, status, and due date when given.",
  "milestones": "Summarize major plan milestones with planned and actual dates when available. Use the provided status terms.",
  "approvals": "List the approvers in signing order including role, organization, and approval date if recorded.",
  "notes": "Include general notes or follow-up items that do not belong in other sections."
}
